alplabai/gd32-bridge-firmware/hal/gd32/init.c
/* The wrapper's PUBLIC include directories expose the GigaDevice device
 * header.  It supplies the CMSIS/core definitions and pulls this project's
 * hal/gd32g5x3_libopt.h selector, which exposes the peripheral declarations
 * used by the real backend.  The vendor wrapper compiles its driver archive
 * independently; libopt controls declarations, not which driver units link. */
#include "gd32g5x3.h"
#include "gd32_common.h"

/* ----------------------------------------------------------------- */
/* Boot hooks (overrides of the weak defaults in src/main.c)         */
/* ----------------------------------------------------------------- */

/* Called once on entry to main() before the transport ISRs come online.
 * This brings up the backend's boot-global clocks, pads and peripheral
 * state; request-time operations live in the per-peripheral TUs.  There is
 * no SysTick handler -- base-level housekeeping runs after each main-loop
 * wake.  No DA9292 wiring exists on this SoM rev; see
 * bridge_hw_da9292_status_cached(). */
/* Sampled at the head of bridge_hw_init (#127); see gd32_common.h for
 * what reads them and why nothing acts on a mismatch yet.  Initialised to
 * the value the constants ASSUME so a debugger attaching before
 * bridge_hw_init has run does not read a spurious 0 and conclude the
 * clock tree is broken. */
uint32_t bridge_core_clock_hz      = PWM_TIMER_CLK_HZ;
bool     bridge_core_clock_matches = true;

/* gh#146: the stack region's lower bound, provided by both linker
 * scripts (toolchain/gd32g553_flash.ld, gd32g553_app_slot.ld.in --
 * _stack_limit = _sp - __stack_size).  Programmed into MSPLIM at the
 * head of bridge_hw_init(). */
extern uint32_t _stack_limit[];

void bridge_hw_init(void)
{
	/* --- Stack costing + MSPLIM limit (gh#146) -----------------------
	 *
	 * THE COSTING (measured, not asserted): a full -Os build of the
	 * gd32 backend with -fstack-usage (real vendor tree,
	 * BRIDGE_OTA_PARTITIONED on) reports the worst single frame in the
	 * firmware's own TUs at 248 bytes (adc_stream.c's FAC decode: the
	 * int16 taps[BRIDGE_DSP_MAX_FIR_TAPS] + float fv[] pair, #132's
	 * bounded stack), then 120 (transport_i2c), then a band of 88-104
	 * (protocol dispatch frames, adc_stream, tmu, gpio).  The deepest
	 * executable chains:
	 *
	 *   CS-EXTI (prio 1) -> protocol_dispatch -> worst opcode handler
	 *     -> adc_stream path .......... <= ~248 + 104 + 88 + frame ~700
	 *   + nested I2C-EV (prio 2) -> protocol_dispatch -> handler ~300
	 *   + 2 exception frames (no FPU context: 32 B each) ........ ~64
	 *   ---------------------------------------------------- approx 1.1 K
	 *
	 * against __stack_size = 2K: roughly 55% of the region on the
	 * worst legal nesting, which is margin, not slack -- the ring of
	 * #36's NMI_Handler on top costs another frame, and #132's taps[]
	 * bound is what keeps the 248 from doubling.  Remeasure after any
	 * change to adc_stream.c's decode (see the -fstack-usage recipe in
	 * the commit message: cmake with -DCMAKE_C_FLAGS="-fstack-usage
	 * -Os", then read the .su files; the bootloader image is measured
	 * the same way against the SAME 2K).
	 *
	 * The limit is enforced, not just measured: MSPLIM (ARMv8-M,
	 * ARMv8-M ARM B3.1) turns any excursion below _stack_limit into a
	 * UseFault that lands in fault_handlers.c's recorder-and-reset
	 * instead of a silent overflow into .heap / .bss.  Set first thing
	 * so everything but the vendor startup's own frames (which are
	 * shallow, register-only) is guarded; __set_MSPLIM() needs no
	 * special care beyond this running once before any nesting. */
	__set_MSPLIM((uint32_t)_stack_limit);
#if defined(BRIDGE_OTA_PARTITIONED) && defined(BRIDGE_APP_SLOT_BASE)
	/* OTA Path-A: the app runs from a flash slot, not 0x08000000, so move
     * the vector table off the vendor SystemInit default before any NVIC
     * use.  Runs first (main calls bridge_hw_init before the transports
     * enable interrupts). */
	SCB->VTOR = (uint32_t)(BRIDGE_APP_SLOT_BASE);
	__DSB();
	__ISB();
	/* The Path-A bootloader hands off with PRIMASK SET (it runs
     * __disable_irq() before swapping MSP/VTOR for the jump) -- without
     * clearing it here no interrupt ever fires in the slot app and the
     * transports go silent (silicon-caught 2026-06-04: CM33 retried init
     * 1600+ times against a slot app whose CS-EXTI could never run).
     * Re-enable now that OUR vector table is live; on a plain power-on
     * boot PRIMASK is already clear and this is a no-op. */
	__enable_irq();
#endif

	/* ORDERING (merge of #61's se_reset_init and #127's clock sample):
     * se_reset_init() goes FIRST and that is load-bearing -- see its
     * comment below on PC13 floating in ANALOG mode from reset.  The
     * clock sample that follows is a pure register read with no side
     * effects and derives nothing se_reset_init() needs (the SE reset is
     * a GPIO push-pull level, with no clock-derived timing anywhere in
     * hal/gd32/se_reset.c), so putting it second costs the #127 check
     * nothing: nothing between these two statements consumes
     * SystemCoreClock either. */
	/* Secure-element reset (SE_RST = PC13): promote it to a released-
     * level push-pull output FIRST, ahead of every other peripheral
     * bring-up below.  PC13 has no entry in `gpio_pad_map` (see
     * hal/gd32/gpio.c), so from reset until whichever statement first
     * touches it, it sits at its GPIO POR default -- ANALOG mode,
     * with the input buffer and both pull resistors disabled (UM
     * Rev1.2 p.270 §7.3.7): genuinely floating, not merely un-pulled.
     * The TRNG bring-up a few statements below this used to run first
     * and can alone spend up to ~1 ms in that state (hal/gd32/trng.c)
     * -- but that is NOT the dominant exposure: the pre-main() SramInit
     * loop floats PC13 for ~20-25 ms before bridge_hw_init() is ever
     * called (see the header comment in hal/gd32/se_reset.c for the
     * derivation).  That window is not fixable by moving this call any
     * earlier -- there is nowhere earlier in this backend to move it
     * to -- so gh#61 stays open after this reorder; this promotion
     * only bounds boot from main() onward and closes the separate
     * sub-microsecond OCTL-preload-vs-mode-promote gap inside
     * se_reset_configure() itself.  Needs only its own GPIOC clock;
     * the bulk AHB2 enable just below
     * re-enables it harmlessly for the rest of port C's pads. */
	rcu_periph_clock_enable(RCU_GPIOC);
	se_reset_init();

